Repository: BarlowTucker/DevChallenges
Catalog: DevChallenges/DevChallenges/*.lproj/Localizable.strings
Languages: es

# title
source: Dev Challenges
es: Pruebas de Devs

# GameSection
source: GAME/UI CHALLENGES
es: PRUEBAS de JUEGO/UI

# LogicSection
source: LOGIC CHALLENGES
es: PRUEBAS de LÓGICA

source: Challenge
es: Prueba

# challenge1-title
source: Light Switches
es: Interruptores de luz

# challenge1-description
source: Imagine a row of N light switches, each attached to a light bulb. All the bulbs are off to start with. You are going to release your inner child so they can run back and forth along this row of light switches, flipping bunches of switches from on to off or vice versa. The challenge will be to figure out the state of the lights after this fun happens.
es: Imagínese una fila de N numero de interruptores de luz, cada uno conectado a una bombilla. Todas las bombillas están apagadas para empezar. Usted va a liberar su niño interior para que pueda correr hacia atrás y adelante a lo largo de esta fila de interruptores de luz, cambiando algunos de los interruptores de encendido a apagado o viceversa. La prueba consistirá en averiguar el estado de las luces después de este divertido sucede.

# challenge2-title
source: Dice
es: Dado

# challenge2-description
source: Make a simple Dice Game (see Challenge Docs for game rules). The simple version of the rules: the player has 3 dice, they roll the dice by pressing a button that says Roll. If they roll a 3 then the game is over.
es: Hacer un juego de dados (ver Challenge Docs para las reglas del juego). La versión simple de las reglas: el jugador tiene 3 dados, se tiran los dados pulsando un botón que dice Roll. Si tiran un 3, el juego ha terminado.

# challenge4-title
source: Photo Browser
es: Explorador de Fotos

# challenge5-title
source: Magic Squares
es: Cuadrados Mágicos

# challenge6-title
source: Moon Lander
es: Luna Aterrizador

# challenge7-title
source: Dev Challenges App
es: App de Pruebas

# challenge8-title
source: Localize
es: Localizar
